{"keras_version": "1.2.1", "config": [{"config": {"nb_row": 5, "input_dtype": "float32", "b_constraint": null, "batch_input_shape": [null, 64, 64, 3], "name": "convolution2d_1", "nb_col": 5, "activation": "linear", "subsample": [2, 2], "trainable": true, "activity_regularizer": null, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "W_constraint": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_row": 3, "subsample": [1, 1], "b_constraint": null, "name": "convolution2d_2", "nb_col": 3, "activation": "linear", "trainable": true, "activity_regularizer": null, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "W_constraint": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"p": 0.4, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "subsample": [1, 1], "b_constraint": null, "name": "convolution2d_3", "nb_col": 3, "activation": "linear", "trainable": true, "activity_regularizer": null, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "W_constraint": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"p": 0.4, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "name": "dense_1", "activation": "linear", "trainable": true, "activity_regularizer": null, "b_regularizer": null, "output_dim": 1024, "init": "glorot_uniform", "W_constraint": null, "bias": true, "W_regularizer": null, "input_dim": 2704}, "class_name": "Dense"}, {"config": {"p": 0.3, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_constraint": null, "name": "dense_2", "activation": "linear", "trainable": true, "activity_regularizer": null, "b_regularizer": null, "output_dim": 512, "init": "glorot_uniform", "W_constraint": null, "bias": true, "W_regularizer": null, "input_dim": 1024}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_constraint": null, "name": "dense_3", "activation": "linear", "trainable": true, "activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "W_constraint": null, "bias": true, "W_regularizer": null, "input_dim": 512}, "class_name": "Dense"}], "class_name": "Sequential"}